app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();

        // NEW CONCEPT: Passing Data to Views
        // We package our data into an associative array.
        // The key 'users' becomes a variable $users inside our HTML view.
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`